<a href="https://colab.research.google.com/github/JakeOh/202011_itw_bd21/blob/main/lab_da/da12_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

DataFrame 합치기

*   merge(join): 두 개의 DataFrame을 공통된 컬럼(들)을 기준으로 합치는 것.
*   concat: DataFrame 축(axis)을 따라서 합치는 것.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'kind': ['a', 'a', 'b', 'b', 'a', 'c'],
    'val_1': range(6)
})

df1

  kind  val_1
0    a      0
1    a      1
2    b      2
3    b      3
4    a      4
5    c      5

In [3]:
df2 = pd.DataFrame({
    'kind': ['a', 'c', 'd'],
    'val_2': [10, 20, 30]
})

df2

  kind  val_2
0    a     10
1    c     20
2    d     30


```
select df1.kind, df1.val_1, df2.val_2
from df1 inner join df2 on df1.kind = df2.kind;
```

In [6]:
pd.merge(left=df1, right=df2)
# pd.merge(left=df1, right=df2, how='inner', on='kind')
# how='inner': merge의 기본값은 innner join이기때문에 생략 가능.
# on='join할 때 사용되는 컬럼(들)': join 조건 컬럼 이름이 같은 경우에는 생략 가능.

  kind  val_1  val_2
0    a      0     10
1    a      1     10
2    a      4     10
3    c      5     20

In [9]:
# df1.merge(df2, how='inner', on='kind')
df1.merge(df2)

  kind  val_1  val_2
0    a      0     10
1    a      1     10
2    a      4     10
3    c      5     20

In [10]:
pd.merge(left=df1, right=df2, how='left')
# NaN: Not a Number
# NA: Not Available

  kind  val_1  val_2
0    a      0   10.0
1    a      1   10.0
2    b      2    NaN
3    b      3    NaN
4    a      4   10.0
5    c      5   20.0

In [11]:
pd.merge(left=df1, right=df2, how='right')

  kind  val_1  val_2
0    a    0.0     10
1    a    1.0     10
2    a    4.0     10
3    c    5.0     20
4    d    NaN     30

In [14]:
pd.merge(left=df1, right=df2, how='outer')

  kind  val_1  val_2
0    a    0.0   10.0
1    a    1.0   10.0
2    a    4.0   10.0
3    b    2.0    NaN
4    b    3.0    NaN
5    c    5.0   20.0
6    d    NaN   30.0

In [22]:
emp = pd.DataFrame({
    'empno': [100, 101],
    'ename': ['Allen', 'Scott'],
    'deptno': [20, 10]
})
emp

   empno  ename  deptno
0    100  Allen      20
1    101  Scott      10

In [23]:
dept = pd.DataFrame({
    'dno': [10, 20],
    'dname': ['IT', 'HR']
})
dept

   dno dname
0   10    IT
1   20    HR

In [24]:
pd.merge(left=emp, right=dept, left_on='deptno', right_on='dno')

   empno  ename  deptno  dno dname
0    100  Allen      20   20    HR
1    101  Scott      10   10    IT